# St7SetBrickOutlineMode

Sets where outlines are drawn around bricks.

long St7SetBrickOutlineMode(long uID, long Mode)

Input Parameters

uID

Strand7 model file ID.

Mode

One of omEdge, omPropertyBoundary, omGroupBoundary, omFacetAngle, omFacetProperty or
omFacetGroup.

Strand7 API Manual